<?
	//端口不一需要修改
	if(isset($_POST['py'])){
	//设置课程数量
	$kecheng = 1;
	$pingyu = $_POST['py'];
	//post评教的数据
	$post2 = "0000000001=0.95&0000000002=0.95&0000000003=0.95&0000000004=0.95&0000000005=0.95&0000000006=0.95&0000000007=0.95&0000000008=0.95&0000000009=0.95&0000000010=0.95&0000000011=0.95&0000000012=0.95&0000000013=0.95&0000000014=0.95&0000000015=0.95&0000000016=0.95&0000000017=0.95&0000000018=0.95&0000000019=0.95&0000000020=0.95&zgpj=+good&kg=%B7%F1&0000000021=0.95&0000000022=0.95&0000000023=0.95&0000000024=0.95&0000000025=0.95&0000000026=0.95&0000000027=0.95&0000000028=0.95&0000000029=0.95&0000000030=0.95&0000000031=0.95&0000000032=0.95&0000000033=0.95&0000000034=0.95&0000000035=0.95&0000000036=0.95&0000000037=0.95&0000000038=0.95&zgpj=+$pingyu&kg=%B7%F1";
	//post编码
	$post2 = mb_convert_encoding($post2, 'GBK', 'utf-8,GBK,ASCII');
	//登录地址 
	$i = 0;
	$url1 = "http://58.192.142.134:8082/jxpg/pg.jsp?wj_num=$i";
	$url2 = "http://58.192.142.134:8082/jxpg/answer.jsp?wj_num=$i";
	for($i=0;$i<=$kecheng;$i++){
	get_content($url1,$_SESSION["cookiesave"],0);
	//上面是get页面
	get_content($url2,$_SESSION["cookiesave"],0,$post2,1);
	}

	//登录后要获取信息的地址 
	$url3 = "http://58.192.142.134:8082/jxpg/list_wj.jsp"; 
	$content = get_content($url3,$_SESSION["cookiesave"],1);
	$content = mb_convert_encoding($content, 'utf-8', 'GBK,UTF-8,ASCII');
	$smarty->assign("yzucontent", $content);
	//泪奔的编码
	}
?>